# SetForcedModalHandling Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureHandlingOptions..::..SetForcedModalHandling Method
FailureHandlingOptions Class See Also
---
Sets a flag indicating whether Revit will show a modal (blocking) error dialog if the transaction failed to finish.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureHandlingOptions SetForcedModalHandling(
	bool bFlag
)
```

Visual Basic
---
```text
Public Function SetForcedModalHandling ( _
	bFlag As Boolean _
) As FailureHandlingOptions
```

Visual C++
---
```text
public:
FailureHandlingOptions^ SetForcedModalHandling(
	bool bFlag
)
```

# ### Parameters
bFlag
    Type: System..::..Boolean True to force Revit to use a modal error dialog, false to allow a non-blocking dialog for warnings resulting from this transaction.
# ### Return Value
This FailureHandlingOptions object.
# See Also
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace